erpdev.СХК_Расширение/src/InformationRegisters/СХК_ЗаданиеНаПечатьЭтикеток/СХК_ЗаданиеНаПечатьЭтикеток.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СХК_ЗаданиеНаПечатьЭтикеток</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>НомерСмены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вложение</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипЭтикетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолЭтикеток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПечати</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказНаПроизводств</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/Enums/ТипыУпаковокНоменклатуры/ТипыУпаковокНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f6b7ee07-c83f-4f1b-8ee5-188b21d078f8">
  <name>ТипыУпаковокНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="205ee147-0f08-4f5c-9b41-406f7a61e2a6">
    <name>Составная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9ab37144-fb76-47e1-9eb2-903dea6c9426">
    <name>Конечная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a56b67d2-eabf-436b-89a2-1b45bd014f46">
    <name>Разупаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="972f66ae-c248-4b9d-b3d7-0c384d9aa068">
    <name>ТоварноеМесто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/InformationRegisters/СХК_ЗаданиеНаПечатьЭтикеток/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	Попытка
		СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Исключение
		СтруктураПараметров = Неопределено;
	КонецПопытки;
	
	Если СтруктураПараметров <> Неопределено Тогда
	
	    Запись.ЗаказНаПроизводств = СтруктураПараметров.Ссылка;
	    Запись.Номенклатура = СтруктураПараметров.Номенклатура;
	    Запись.Серия = СтруктураПараметров.Серия;
		Запись.Пользователь = Пользователи.АвторизованныйПользователь(); 
        //Запись.Вложение = СтруктураПараметров.Серия.СХК_Упаковка;
		Запись.ДатаПечати = ТекущаяДата();
		
		
		Если СтруктураПараметров.Серия.СХК_Упаковка.ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры.Составная Тогда 
			ЭтаФорма.Элементы.Информация.Заголовок = "Информация для печати: " + Строка(СтруктураПараметров.Серия.СХК_Упаковка) + " вложение по (" +Строка(СтруктураПараметров.Серия.СХК_Упаковка.Родитель)+")";
		
			ЭтаФорма.СЗУпаковки = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
		
			Список = Новый СписокЗначений; 
			Список.Очистить();
			Список.Добавить(СтруктураПараметров.Серия.СХК_Упаковка);		
			Список.Добавить(СтруктураПараметров.Серия.СХК_Упаковка.Родитель);		
			ЭтаФорма.Элементы.СЗУпаковки.СписокВыбора.ЗагрузитьЗначения(Список.ВыгрузитьЗначения()); 
			
		Иначе
			ЭтаФорма.Элементы.Информация.Заголовок = "Информация для печати: " + Строка(СтруктураПараметров.Серия.СХК_Упаковка);
			Запись.Вложение = СтруктураПараметров.Серия.СХК_Упаковка;
		КонецЕсли;
		
		
	Иначе 
		
		ЭтаФорма.ТолькоПросмотр = Истина; 
		ЭтаФорма.Элементы.СЗУпаковки.Видимость = Ложь;
		Если Запись.Серия.СХК_Упаковка.ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры.Составная Тогда 
			ЭтаФорма.Элементы.Информация.Заголовок = "Информация для печати: " + Строка(Запись.Серия.СХК_Упаковка) + " вложение по (" +Строка(Запись.Серия.СХК_Упаковка.Родитель)+")";
		Иначе
			ЭтаФорма.Элементы.Информация.Заголовок = "Информация для печати: " + Строка(Запись.Серия.СХК_Упаковка);	    	
		КонецЕсли;
			
   КонецЕсли;
//
КонецПроцедуры

&НаКлиенте
Процедура СЗУпаковкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	СЗУпаковкиПриИзмененииНаСервере(ВыбранноеЗначение);
КонецПроцедуры  

&НаСервере
Процедура СЗУпаковкиПриИзмененииНаСервере(Эл)  
	Запись.Вложение = Эл;

КонецПроцедуры


&НаКлиенте
Процедура Старт(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Статус = "" Тогда
		ТекущийОбъект.Статус = "Создан";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) 
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура ППриИзмененииНаСервере()
	Если П = Истина Тогда
		ЭтаФорма.Элементы.ФормаЗаписатьИЗакрыть.Доступность = Истина;
	Иначе
		ЭтаФорма.Элементы.ФормаЗаписатьИЗакрыть.Доступность = Ложь;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ППриИзменении(Элемент)
	ППриИзмененииНаСервере();
КонецПроцедуры
